fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

//&НаКлиенте
//Процедура Команда1(Команда)
 //   ПолучитьНаСервере();
//КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Ссылка = Объект.Ссылка;
	Дата = Объект.Дата;
	ДатаПроведенияРабот = Объект.ДатаПроведенияРабот;
	ВремяНачалаРабот = Объект.ВремяНачалаРабот;
	ВремяОкончанияРабот = Объект.ВремяОкончанияРабот;
	Специалист = Объект.Специалист;
	СимволыПС = Символы.ПС;
	ФорматВремени = "ДЛФ=В";
	Если Ссылка.Пустая() Тогда
		ПустаяДата = Дата('00010101');
		СообщениеТекст = СтрШаблон("Новый документ. Дата: %1", Дата);
		Если ДатаПроведенияРабот <> ПустаяДата Тогда
			СообщениеТекст = СтрШаблон("%1%2Дата проведения работ: %3", СообщениеТекст, СимволыПС, ДатаПроведенияРабот);
		КонецЕсли; 
		Если ВремяНачалаРабот <> ПустаяДата Тогда
			СообщениеТекст = СтрШаблон("%1%2Время начала работ: %3", СообщениеТекст, СимволыПС, Формат(ВремяНачалаРабот, ФорматВремени));
		КонецЕсли; 
		Если ВремяОкончанияРабот <> ПустаяДата Тогда
			СообщениеТекст = СтрШаблон("%1%2Время окончания работ: %3", СообщениеТекст, СимволыПС, Формат(ВремяОкончанияРабот, ФорматВремени));
		КонецЕсли; 
		Если Не ПустаяСтрока(Специалист) Тогда
			СообщениеТекст = СтрШаблон("%1%2Специалист: %3", СообщениеТекст, СимволыПС, Специалист);
		КонецЕсли; 
	Иначе
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Дата,
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот,
		|	ВКМ_ОбслуживаниеКлиента.Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|	И НЕ (ВКМ_ОбслуживаниеКлиента.Дата = &Дата
		|	И ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот = &ДатаПроведенияРабот
		|	И ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот = &ВремяНачалаРабот
		|	И ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот = &ВремяОкончанияРабот
		|	И ВКМ_ОбслуживаниеКлиента.Специалист = &Специалист)"; 
		Запрос.УстановитьПараметр("Ссылка", Ссылка); 
		Запрос.УстановитьПараметр("Дата", Дата); 
		Запрос.УстановитьПараметр("ДатаПроведенияРабот", ДатаПроведенияРабот); 
		Запрос.УстановитьПараметр("ВремяНачалаРабот", ВремяНачалаРабот); 
		Запрос.УстановитьПараметр("ВремяОкончанияРабот", ВремяОкончанияРабот); 
		Запрос.УстановитьПараметр("Специалист", Специалист); 
		Выборка = Запрос.Выполнить().Выбрать(); 
		Если Выборка.Следующий() Тогда 
			СообщениеТекст = "Документ изменен:";
			ВыборкаДата =  Выборка.Дата;
			Если ВыборкаДата <> Дата Тогда
				СообщениеТекст = СтрШаблон("%1%2Предыдущая дата: %3 Новая дата: %4", СообщениеТекст, СимволыПС, ВыборкаДата, Дата);
			КонецЕсли; 
			ВыборкаДатаПроведенияРабот = Выборка.ДатаПроведенияРабот;
			Если ВыборкаДатаПроведенияРабот <> ДатаПроведенияРабот Тогда
				СообщениеТекст = СтрШаблон("%1%2Старая дата проведения работ: %3 Новая дата проведения работ: %4", СообщениеТекст, СимволыПС, ВыборкаДатаПроведенияРабот, ДатаПроведенияРабот);
			КонецЕсли;
			ВыборкаВремяНачалаРабот = Выборка.ВремяНачалаРабот;
			Если ВыборкаВремяНачалаРабот <> ВремяНачалаРабот Тогда
				СообщениеТекст = СтрШаблон("%1%2Старое время начала работ: %3 Новое время начала работ: %4", СообщениеТекст, СимволыПС, Формат(ВыборкаВремяНачалаРабот, ФорматВремени), Формат(ВремяНачалаРабот, ФорматВремени));
			КонецЕсли; 
			ВыборкаВремяОкончанияРабот = Выборка.ВремяОкончанияРабот;
			Если ВыборкаВремяОкончанияРабот <> ВремяОкончанияРабот Тогда
				СообщениеТекст = СтрШаблон("%1%2Старое время окончания работ: %3 Новое время окончания работ: %4", СообщениеТекст, СимволыПС, ВыборкаВремяОкончанияРабот, ВремяОкончанияРабот);
			КонецЕсли;
			ВыборкаСпециалист = Выборка.Специалист;
			Если ВыборкаСпециалист <> Специалист Тогда
				СообщениеТекст = СтрШаблон("%1%2Предыдущий специалист: %3 Текущий специалист: %4", СообщениеТекст, СимволыПС, ВыборкаСпециалист, Специалист);
			КонецЕсли; 
		Иначе
			СообщениеТекст = "";
		КонецЕсли; 
	КонецЕсли; 
	Если Не ПустаяСтрока(СообщениеТекст) Тогда 
		НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.СоздатьЭлемент(); 
		НовыйЭлемент.Текст = СообщениеТекст; 
		НовыйЭлемент.Записать();
	КонецЕсли;
	 	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//&НаСервере
//Процедура ПолучитьНаСервере()
//	ВКМ_Телеграм.ПолучитьНаВходТекстСообщения();
//КонецПроцедуры

#КонецОбласти

#КонецОбласти
